
value = 0

while True :
    x = int(input())
    print('ви ввели', x)
    if x == -1:
        break
    if x != 0 and x != 1:
        print('слід було ввести або 0, або 1')
        print('повторіть спробу ще раз')
        continue
    # x -- чергова цифра (у двійковій системі числення)
    value = 2 * value + x

    print('цикл продовжується')
# value = 2 * (2 * (2 * (2 * value_початкове + x_найнайраніше) + x_найраніше) + x_раніше) + x_останнє --
# так "на льоту" в потрібних місцях формули утворюютсья 2 у правильних степенях

print('цикл завершився')
print(value)