# Є деяке речення на невідомій мові. Порахувати кількість слів у ньому.
# Літерами алфавіту у невідомій мові є літери латинського алфавіту та арабські цифри.
# Гарантується, що інших символів, крім пропусків та розділових знаків у реченні нема.

txt = "kykuyvkutvu lubkuy, vt123ctjyc ku867756tcj cyjrcx"
#txt = "hey py"
L = []
s = ''
for c in txt:
    if c == ' ':
        print('слово:', s)
        s = ''
    else:
        s = s + c
if len(s) > 0:
    print('і ще слово:', s)

#
print(txt.split())
# s = ''
# for el in ['h', 'e', '1', '0', 'w']:
#     s = s + el
#     print(el, s)
